Merge pull request #4 from TomokiMiyauci:beta
Beta
